In [9]:
import numpy as np

In [10]:
import pandas as pd

In [11]:
from numpy.random import randn

In [12]:
np.random.seed

In [13]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  0.215581  0.097307  0.477525  0.270884
B -0.527743  0.119935 -0.315058  1.417737
C  0.663052 -0.670721  0.281212  0.647304
D  0.629795 -0.889820  0.526336  0.009030
E  0.242927  0.819033 -0.644219  1.266256

In [15]:
df['W']

A    0.215581
B   -0.527743
C    0.663052
D    0.629795
E    0.242927
Name: W, dtype: float64

In [16]:
df[['W']]

          W
A  0.215581
B -0.527743
C  0.663052
D  0.629795
E  0.242927

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
# a dataframe are series that share an index

In [20]:
df[['W','Z']]

          W         Z
A  0.215581  0.270884
B -0.527743  1.417737
C  0.663052  0.647304
D  0.629795  0.009030
E  0.242927  1.266256

In [21]:
df['new'] = df['W'] + df['Y'] # creates new column

In [31]:
df

          W         X         Y         Z       new
A  0.105252 -0.837641  0.385541  0.092459  0.490793
B -0.761509  0.131793 -1.082869  1.686777 -1.844378
C  1.094400  0.386607  0.172266  0.415710  1.266666
D  0.619343  0.313573 -0.492715 -0.189361  0.126629
E -0.332138 -0.512740  0.484338 -0.037009  0.152201

In [32]:
df.drop('new',axis=1,inplace=True) # drops column, inplace=True to drop permanently

In [33]:
df

          W         X         Y         Z
A  0.105252 -0.837641  0.385541  0.092459
B -0.761509  0.131793 -1.082869  1.686777
C  1.094400  0.386607  0.172266  0.415710
D  0.619343  0.313573 -0.492715 -0.189361
E -0.332138 -0.512740  0.484338 -0.037009

In [47]:
df.drop('A')

          W         X         Y         Z
B -0.761509  0.131793 -1.082869  1.686777
C  1.094400  0.386607  0.172266  0.415710
D  0.619343  0.313573 -0.492715 -0.189361
E -0.332138 -0.512740  0.484338 -0.037009

In [35]:
# ROWS

In [36]:
df

          W         X         Y         Z
A  0.105252 -0.837641  0.385541  0.092459
B -0.761509  0.131793 -1.082869  1.686777
C  1.094400  0.386607  0.172266  0.415710
D  0.619343  0.313573 -0.492715 -0.189361
E -0.332138 -0.512740  0.484338 -0.037009

In [37]:
df.loc['A']

W    0.105252
X   -0.837641
Y    0.385541
Z    0.092459
Name: A, dtype: float64

In [41]:
df.loc[['A']]

          W         X         Y         Z
A  0.105252 -0.837641  0.385541  0.092459

In [42]:
df.iloc[2]

W    1.094400
X    0.386607
Y    0.172266
Z    0.415710
Name: C, dtype: float64

In [43]:
df.loc['B','Y']

-1.0828687154782803

In [44]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  0.105252  0.385541
B -0.761509 -1.082869

Review

---

In [ ]:
df = pd.DataFrame(randn(rows,columns),[rowindex],[columnindex])  # creates a dataframe rowXcolumn of rndomly distributed nums

df[index]  # shows the pandas series in the column

df[[index]]  # shows the data in the column

df[[indexA,indexB]]  # shows multiple columns

df[newindex] = df[indexA] + df[indexB]  # creates new column with newindex

df.loc['index']  # shows the row at index

df.loc['B','Y'] # shows data at row=B,colum=Y

df.loc[['row1','row2'],['column1','column2']]  # indexes row and columns

df.iloc[number]  # indexes row by number

df.drop(column/row,axis=1/0,inplace=True/False)  # drops column/row (define axis), inplace defines if permanent drop or not

---

In [48]:
df

          W         X         Y         Z
A  0.105252 -0.837641  0.385541  0.092459
B -0.761509  0.131793 -1.082869  1.686777
C  1.094400  0.386607  0.172266  0.415710
D  0.619343  0.313573 -0.492715 -0.189361
E -0.332138 -0.512740  0.484338 -0.037009

In [49]:
# conditional selection

In [50]:
booldf = df > 0

In [51]:
booldf

       W      X      Y      Z
A   True  False   True   True
B  False   True  False   True
C   True   True   True   True
D   True   True  False  False
E  False  False   True  False

In [52]:
df[booldf]

          W         X         Y         Z
A  0.105252       NaN  0.385541  0.092459
B       NaN  0.131793       NaN  1.686777
C  1.094400  0.386607  0.172266  0.415710
D  0.619343  0.313573       NaN       NaN
E       NaN       NaN  0.484338       NaN

In [53]:
df[df>0]

          W         X         Y         Z
A  0.105252       NaN  0.385541  0.092459
B       NaN  0.131793       NaN  1.686777
C  1.094400  0.386607  0.172266  0.415710
D  0.619343  0.313573       NaN       NaN
E       NaN       NaN  0.484338       NaN

In [54]:
df['W']>0

A     True
B    False
C     True
D     True
E    False
Name: W, dtype: bool

In [55]:
df[df['W']>0]

          W         X         Y         Z
A  0.105252 -0.837641  0.385541  0.092459
C  1.094400  0.386607  0.172266  0.415710
D  0.619343  0.313573 -0.492715 -0.189361

In [56]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.105252 -0.837641  0.385541  0.092459
1     B -0.761509  0.131793 -1.082869  1.686777
2     C  1.094400  0.386607  0.172266  0.415710
3     D  0.619343  0.313573 -0.492715 -0.189361
4     E -0.332138 -0.512740  0.484338 -0.037009

In [57]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [59]:
df['States'] = newind  # creates new column with states

In [60]:
df

          W         X         Y         Z States
A  0.105252 -0.837641  0.385541  0.092459     CA
B -0.761509  0.131793 -1.082869  1.686777     NY
C  1.094400  0.386607  0.172266  0.415710     WY
D  0.619343  0.313573 -0.492715 -0.189361     OR
E -0.332138 -0.512740  0.484338 -0.037009     CO

In [61]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.105252 -0.837641  0.385541  0.092459
NY     -0.761509  0.131793 -1.082869  1.686777
WY      1.094400  0.386607  0.172266  0.415710
OR      0.619343  0.313573 -0.492715 -0.189361
CO     -0.332138 -0.512740  0.484338 -0.037009

In [5]:
mylist = '1 2 3 4 5'.split()

In [6]:
mylist

['1', '2', '3', '4', '5']

---

In [ ]:
df[booldf]  # show where boolean is true in dataframe

df[(df['W']>0) & (df['Y']>1)]  # show where data in colum W is more than 0 AND data in colum Y is more than 1

df[(df['W']>0) | (df['Y']>1)]  # show where data in colum W is more than 0 OR data in colum Y is more than 1

df.reset_index()  # makes index default 0,1,2,3,4; must be in place for permanent change

df.set_index('title') = listA  # sets index with title and assigns items in list in order of index to the dataframe

mylist = '1 2 3 4 5'.split()  # returns list and seperates elements by whitespace

---

In [22]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))  # creates tuple pairs with matching index
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [23]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [24]:
df

             A         B
G1 1  0.945347  1.029360
   2  0.296411  1.209922
   3 -1.045293  1.361593
G2 1  1.936668  0.880130
   2 -1.157798  0.287768
   3  2.214004 -1.498475

In [28]:
df.loc['G1'].loc[[1]]

          A        B
1  0.945347  1.02936

In [30]:
df.index.names = ['Groups','Num']

In [31]:
df

                   A         B
Groups Num
G1     1    0.945347  1.029360
       2    0.296411  1.209922
       3   -1.045293  1.361593
G2     1    1.936668  0.880130
       2   -1.157798  0.287768
       3    2.214004 -1.498475

In [33]:
df.loc['G2'].loc[2]['B']

0.28776817763486734

In [36]:
df.xs(1,level='Num')  # we see where num = 1 in both groups

               A        B
Groups
G1      0.945347  1.02936
G2      1.936668  0.88013

---

In [ ]:
df.loc[rowLevelONE].loc[[rowLevelTWO]]  # selecting multi level index

df.loc[rowLevelONE].loc[[rowLevelTWO]][column]  # selecting specficic value in multi level dataframe

df.xs(indexValue,level='columnTitle')  # (cross section) selecting the rows in column where index is [indexValue]

---